# put your python code here
a, b = input(), input()
if (a == "красный" or b == "красный") and (a == 'синий' or b == 'синий'):
    print('фиолетовый')
elif (a == "красный" or b == "красный") and (a == 'желтый' or b == 'желтый'):
    print('оранжевый')
elif (a == "желтый" or b == "желтый") and (a == 'красный' or b == 'красный'):
    print('оранжевый')
elif (a == "желтый" or b == "желтый") and (a == 'синий' or b == 'синий'):
    print('зеленый')
elif (a == "синий" or b == "синий") and (a == 'желтый' or b == 'желтый'):
    print('зеленый')
elif (a == "синий" or b == "синий") and (a == 'красный' or b == 'красный'):
    print('фиолетовый')
elif (a == "красный" and b == "красный") or (a == 'красный' and b == 'красный'):
    print('красный')
elif (a == "синий" and b == "синий") or (a == 'синий' and b == 'синий'):
    print('синий')
elif (a == "желтый" and b == "желтый") or (a == 'желтый' and b == 'желтый'):
    print('желтый')
else:
    print('ошибка цвета')